#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <math.h>
void way1(double x,double eps);//описываем функцию для 1 способа вычисления
void way2(double x,int n);//описываем функцию для 2 способа вычисления
int fact(int p);//описываем функцию для вычисления факториала
int main()
{
	int  way,n;//описываем переменную
	double x,eps;//описываем пересенные
	printf("Lab 3,variant 13\n");//выводим номер варианта
	printf("choose 1 or 2 way of calculation:");//просим выбрать способ вычисления
	scanf("%d", &way);//считываем спосоь вычисления
	switch (way)//используем оператор выбора
	{
		case 1://описываем способ 1
		{
			printf("Incert x from -1 to 1:");//просим ввести значение х
			scanf("%lf", &x);//считываем значение х
			if (fabs(x) > 1)//проверям, удовлетворяет ли х условию
			{
				printf("x does not satisfy the condition\n");//говорим, что х не удовлетворяет условию
				return 0;//завершаем выполнение
			}
			printf("Incert eps:\n");//просим ввсести значение точности
			scanf("%lf", &eps);//считываем значение точности
			way1(x,eps);//вызываем фунцию, для выполнения вычисления 1 способом
			break;//завершаем выполнение 1 способом
		}
		case 2://описываем способ 2
		{
			printf("Incert x from -1 to 1:");//просим ввсети значение х
			scanf("%lf", &x);//считываем значение х
			if (fabs(x) > 1)//проверям, удовлетворяет ли х условию
			{
				printf("x does not satisfy the condition\n");//говорим, что х не удовлетворяет условию
				return 0;//завершаем выполнение
			}
			printf("Incert n:");//просим ввести значение n
			scanf("%d", &n);//считываем значение n
			way2(x,n);//вызываем фунцию, для выполнения вычисления 2 способом
			break;//завершаем выполнение 2 способом
		}
		default://описываем действия, если ни один из способов не выполнился
		{
			printf("this way of calculation does not exist");//говорим, что другого способа вычисления не существует
			return 0;//завершаем выполнение
		}
	}
	return 0;
}
void way1(double x,double eps)//описываем выполнение функции для способа 1
{
	int i,n, factorial;//описываем переменные
	double sumf, xi,func;//описываем переменные
	sumf = 1;//задаем первое слагаемое суммы
	xi = eps +1;//задаем значение xi
	for (i = 1; fabs(xi) > eps; i++)//условие выполнения цикла
	{
		factorial=fact(2*i);//вызываем функцию вычисления факториала
		xi = (pow(-1, i)*factorial*pow(x, i)) / ((1 - 2 * i)*fact(i)*fact(i)*pow(4, i));//вычисляем итый элемент
		sumf += xi;//считаем сумму i членов
		n = i;//запоминаем количество итераций
	}
	func = sqrt(1 + x);//вычисляем значение функции
	printf("sqrt(1+x)=%lf\n",sumf);//выводим значение суммы элементов
	printf("sqrt(1+x)=%lf\n",func);//выврдим значение функции
	printf("n=%d", n);//выводим количество итераций
}
void way2(double x, int n)//описываем выполнение функции для способа 2
{
	int i,factorial;//описываем переменные
	double xi, sumf,func,k;//описываем переменные
	sumf = 1;//вводим значение суммы
	xi = 1;
	for (i = 1; i < n; i++)//условие выполнения цикла
	{
		k = (x*2*i*(3-2*i))/(4*i*i);//считаем коэффициент
		xi *= k;//считаем итый член
		sumf += xi;//считаем сумму элементов
	}



	printf("sum of %d elements=%lf\n", n,sumf);//выводим значение суммы заданного количества эелементов
	func = sqrt(1 + x);//вычисляем значение функции
	printf("sqrt(1+x)=%lf\n", func);//выврдим значение функции
}
int fact(int p)//описываем функцию для вычисления факториала
{
	int i,factorial;//описываем переменные
	 factorial = 1;//присваиваем значение
	 for (i = 1; i <= p; i++) //условие выполнения цикла
	 {
		 factorial *= i;//вычисление факториала
	 }
	return factorial;//возвращаем значение факториала
}
