#include <stdio.h>//поключаем библиотеку для ввода/вывода
#include <stdlib.h>//подключаем библиотеку для использования malloc

int* createarray(int w, int h)//описываем функцию для создания массива
{
	int *A,i,j;//описываем переменные
	A = (int*)(malloc(w*h * sizeof(int)));//выделяем память
	for (i = 0; i < h; i++)//цикл для строк
	{
		for (j = 0; j < w; j++)//цикл для столбцов
		{
			printf("A[%d][%d]= ", i, j);//оформление интерфейса
			scanf_s("%d", &A[w*i + j]);//ввод массива
		}
	}
	printf("\n");//оформление интерфейса
	return A;//возвращаем массив
}
void printarray(int w, int h, int* A)//описываем функцию для вывода массива
{
	int i, j;//описываем переменные
	for (i = 0; i < h; i++)//цикл для строк
	{
		for (j = 0; j < w; j++)//цикл для столбцов
		{
			printf("A[%d][%d]=%d ", i, j, A[i*w + j]);//вывод массива
		}
		printf("\n");
	}
	printf("\n");//оформление интерфейса
}
void task(int w, int h, int* A)//описываем функцию для выполнения задания
{
	int i, j,max,k,count,countmax;//описываем переменные
	count = 0;//счетчик для конечного вывода
	countmax = 0;//счетчик для конечного вывода
	for(i = 0; i < h; i++)//цикл для строк
	{
		for (j = 0; j < w; j++)//цикл ля столбцов
		{
			if (i==j)//находим элементы на главной диагонали
			{
				countmax++;//увеличиваем счетчик
				if (A[i*w + j] % 2 == 0)//проверяем их четность
				{
					for (k = 0; k < w; k++)//проверяем строку, с таким элементом
					{
						if (A[i*w + k] % 2 != 0)//находим первый нечетный элемент
						{
							max = A[i*w + k];//принимаем его за максимум
							count++;//изменяем счетчик
							break;//завершаем цикл
						}
					}
					for (k = 0; k < w; k++)//проходим по нужной строке
					{
						if (A[i*w+k]%2!=0 && max < A[i*w + k])//находим максимальный нечетный элемент в строке
						{   
							max = A[i*w + k];//заменяем максимум
						}
					}
					if (count != 0)//проверяем счетчик
					{
						printf("max%d=%d\n", countmax, max);//выводим максимальный нечетный элемент в строке
					}
					count = 0;//обнуляем счетчик
				}
			}
		}
	}
}
int main()//тело функции
{
	int n, m,*A;//описываем переменные
	printf("Lab #5 variant 13\n");//выводим носер варианта и лабораторной работы
	printf("Insert size of array\nn=");//просим ввести размеры массива
	scanf_s("%d", &n);//считываем количество строк
	printf("m=");//просим ввести количество столбцов
	scanf_s("%d", &m);//считываем количество столбцов
	if (m < 2 || m>10 || n < 2 || n>10 || n != m)//проверяем, соответствуют ли размеры условию
	{
		printf("Incorrect size");//выводим ошибку, если не соответствуют
		return 0;//завершаем выполнение программы
	}
	A=createarray(n, m);//вызываем функцию для создания массива
	if (!A)//проверяем выделение памяти
	{
		return 0;//завершаем выполнение программы
	}
	printarray(n, m, A);//вызываем функцию для вывода массива
	task(n, m, A);//вызываем функцию для выполнения задания
	free(A);//освобождаем память
	return 0;//завершаем выполнение программы
}
