#include <stdio.h>  
#include <string.h> 
#include <malloc.h> 
void task(char* str, int l)//функция для выполнения задания
{
	char* del = ",.";//переменная, которая показывает элементы для разделения на слова
	char* next;//вспомогательная переменная для функции разделения на слова
	char **arr;//массив слов
	int i, c, j, q;//счетчики
	c = 0;//начальное значение
	for (i = 0; i < l; i++)//цикл для подсчета слов в строке
	{
		if (str[i] == ',')//критерий разделения на слово
		{
			c++;//изменеие счетчика
		}
	}
	arr = (char**)malloc((c + 1) * sizeof(char*));//выделение памяти для массива слов
	i = 0;//начальное значение
	arr[i] = strtok_s(str, del, &next);//ввод массива
	while (arr[i] != NULL)//цикл для ввода массива
	{
		i++;//изменение счетчика
		arr[i] = strtok_s(NULL, del, &next);//ввод массива
	}
	for (i = 0; i <= c; i++)//цикл для нахождения одинаковых слов
	{
		q = 0;//начальное значение
		for (j = 0; j <= c; j++)//цикл для сравнения слов
		{
			if (strcmp(arr[i], arr[j]) == 0)//функция по сравнению слов
			{
				q++;//изменяем счетчик
			}
		}
		if (q == 1)//если счетчик равен 1(т.е. слово равно само себе) 
		{
			printf("%s ", arr[i]);//выводим слово
		}
	}
	printf("\n");//выводим пробел
}
int main()
{
	printf("Lab #6, var 13\n");//выводим номер варианта и лабораторной работы
	int l;//длина строки
	char str[331], s[331], t[331],test[331] = "abc,art,abc,asd.";//текстовые переменные
	puts(test);//вывод внутренней строки
	strcpy_s(t, 331, test);//копирование строки
	task(t, strlen(t));//вызов функции
	printf("incert string less then 330 elements\n");//оформление интерфейса
	fgets(str, 331, stdin);//ввод строки
	strcpy_s(s, 331, str);//копируем строку
	l=strlen(str);//нахождение длины строки
	if (l > 331)//проверка условия
	{
		printf("error");//сообщение об ошибке
		return 0;
	}
	task(s,l);//вызов функции
	return 0;
}
