#include <stdio.h>
int proverka(double x, double y);//добавляем функцию
int main()
{
	double x, y;//описываем используемые переменные
	printf("insert any x:\n");//просим ввести значение х
	scanf_s("%lf", &x);//вводим значение х
	printf("insert any y:\n");//просим ввести значение у
	scanf_s("%lf", &y);//вводим значение у
	if (x <= 0)//проверям меньше или равен ли х нулю
	{
		if (x >= -1)//проверям больше или равен ли х -1
		{
			if (y <= -x)//проверям меньше или равен ли у -х
			{
				if (y >= -2)//проверям больше или равен ли у -2
				{
					printf("prinadlejit\n");//если все условия выполнены, то выводим "принадлежит"
				}
				else//если у меньше -2 
				{
					printf("prinadlejit\n");//выводим "не принадлежит"
				}
			}
			else//если у больше -х
			{
				printf("ne prinadlejit\n");//выводим "не принадлежит"
			}
		}
		else//если х меньше -1
		{
			printf("ne prinadlejit\n");//выводим "не принадлежит"
		}
	}
	else//если х больше 0,то
	{
		if (x <= 1)//если х меньше или равен 1,то
		{
			if (y <= x)//проверяем, если у меньшн или равен х,то
			{
				if (y >= -2)//проверяем, если у больше или равен -2,то
				{
					printf("prinadlejit\n");//выводим "принадлежит"
				}
				else//если у меньше -2, то
				{
					printf("neprinadlejit\n");//выводим "не принадлежит"
				}
			}
			else//если у больше х
			{
				printf("ne prinadlejit\n");//выводим "не принадлежит"
			}
		}
		else//если х больше 1
		{
			printf("ne prinadlejit\n");//выводим "не принадлежит"
		}
	}
	if (((x <= 0) && (x >= -1) && (y <= -x) && (y >= -2)) || ((x > 0) && (x <= 1) && (y <= x) && (y >= -2)))//задаем сложное условие для возврата значения
	{
		printf("prinadlejit\n");//если оно выполняется, выводим "принадлежит"
	}
	else//иначе
	{
		printf("ne prinadlejit\n");//выводим "не принадлежит"
	}
	if (proverka(x, y))//проверяем значение, которое возвращает функция
	{
		printf("prinadlejit\n");//если оно истинно, то выводим  "принадлежит"
	}
	else//иначе
	{
		printf("ne prinadlejit\n");//выводим "не принадлежит"
	}

		return 0;
} 
int proverka(double x,double y)//задаем функцию
{
	return (((x <= 0) && (x >= -1) && (y <= -x) && (y >= -2)) || ((x > 0) && (x <= 1) && (y <= x) && (y >= -2)));//прописываем условие
}
