#include"stdio.h"//подключение библиотеки
#include"stdlib.h"//подключение библиотеки
#include"TV.h"//подключение файла со структурами 

#define W //определяем переменную
int main()
{
	int n;//объявляем переменную
	printf("Lab#7 var#13\n");//вывод номера лабораторной работы
#ifdef W//условие для компилятора
	
		struct TV data[] = { "Samsung", "Moscow","Chaika", 1956,15000,50,//вводим свою структуру
		"Samsung", "Tula","Oktava", 1976,15000,50,
		"Samsung", "London","Hetrow", 1999,30000,70,
		"LG", "New-York","Harrords", 2015,50000,90,
		"LG", "Paris","Laduree", 2010,10000,20 };
		n = sizeof(data) / sizeof(data[0]);//определяем размер структуры из одного элемента
		check(data, n);//вызов функции для проверки введенных данных
		printstr(data, n);//вызов функции для вывода введенных данных
		task(data, n);//вызов функции для выполнения задания
#else//если условие не выполнится
		{
		struct TV data[20];//объявляем структуру
		printf("How many TVs do you want to input? ");//просим ввести количество элементов в структуре
		scanf_s("%d", &n);//считываем количество элементов в структуре
		if ((n > 20)&&(n<=0))//проверяем соответствие условию
		{
			printf("incorrect input");//сообщаем об ошибке в случае неправильного ввода
			return 0;//завершаем выполнение
		}
		else//иначе
		{
			scanstr(data, n);//вызов функции для ввода данных
			check(data, n); //вызов функции для проверки введенных данных
			printstr(data, n);//вызов функции для вывода введенных данных
			task(data, n);//вызов функции для выполнения задания
		}
	}
#endif//конец условия для компилятора
	system("pause");//строка для того, чтобы было видно окно компиляции
	return 0;//завершение программы
}
