#include <stdio.h>
#include <malloc.h>
int *B;//описываем глобальную переменную
void *createmasB(int k)//описываем функцию по созданию массива
{
	int i, x, y;//описываем переменные
	B = (int*)malloc(k * sizeof(int));//освобождаем память
	for (i = 0; i < k; i++)//вводим значения массива
	{
		printf("B[%d]=", i);//оформляем ввод для пользователя
		scanf_s("%d", &B[i]);//считываем значения массива
	}
	printf("\n");//используем для красоты интерфейса
}
void printmasB(int k)//описываем функцию для вывода массива
{
	int i;//описываем переменную
	for (i = 0; i < k; i++)//оформляем вывод для пользователя
	{
		printf("B[%d]=%d\n", i, B[i]);//выводим массив
	}
}
void task1(int k)//описываем функцию для решение 1 задачи
{
	int j, max, i,x,y;//описываем переменные
	j = -1;//вводим счетчик элементов, удовлетворяющий условию
	printf("incert x:");//просим ввести значение х
	scanf_s("%d", &x);//считываем значение х
	printf("incert y:");//просим ввести значение у
	scanf_s("%d", &y);//считываем значение у
	if (x > y)//проверяем корректность введенных данных
	{
		printf("task 1 can not be solved\n");//сообщаем об ошибке
		return;//завершаем выполнение функции
	}
	for (i = 0; i < k; i++)//находим элементы, удовлетворяющие условию
	{
		if (B[i] >= x && B[i] <= y)//проверяем, удовлетворяет ли элемент массива условию
		{
			j++;//меняем счетчик
		}
		if (j == 0)//проверяем наличие элементов, удовлетворяющих условию
		{
			max = B[i];//находи максимальный элемент
			break;//заканчиваем выполнение цикла
		}
	}
	if (j == -1)//проверяем наличие элементов, удовлетворяющих условию
	{
		printf("there are no elements that satisfy the condition\n");//если таких нет, то сообщаем об ошибке
		return;//заканчиваем выполнение функции
	}
	for (i = 0; i < k; i++)//цикл для нахождения максимального элемента
	{
		if (B[i] >= x && B[i] <= y && max < B[i])//находим максимальный элемент
		{
			max = B[i];//меняем предыдущее значение
		}
	}
	printf("max element=%d\n", max);//выводим максимальный элемент
}
void task2(k)//описываем функцию по выполненю 2 задачи
{
	int i,j,min,pos,sum;//описываем переменные
	double average;//описываем переменную
	j=-1;//вводим значение счетчика
	for (i = 0; i < k; i++)//находим нечетные элементы
	{
		if (B[i] % 2 != 0)//проверяем элемент массива
		{
			j++;//меняем значение счеичика
		}
		if(j==0)//проверяем наличие нечетных элементов
		{
			min = B[i];//находим минимальный элемент
			pos = i;//запоминаем номер минимального элемента
			break;//заканчиваем цикл
		}
	}
	if(j==-1)//проверяем есть ли в массиве нечетные элементы
	{
		printf("there are no odd elements");//сообщаем об ошибке
		return;//заканчиваем выполнение функции
	}
	for (i = 0; i < k; i++)//находим минимальный нечетный элемент
	{
		if (B[i]%2 !=0 && B[i]<min)//проверяем условие
		{
			min = B[i];//меняем значение минимального элемента
			pos = i;//запоминаем ноиер минимального элемента
		}
	}
	if (pos == 0)//проверяем, можно ли найти среднее арифметическое
	{
		printf("task 2 can not be solved\n");//сообщаем об ошибке
		return;//завершаем выполнение функции
	}
	sum = 0;//пишем начальное значение суммы
	for (i = 0; i < pos; i++)//считаем сумму элементов до первого минимального нечетного
	{
		sum += B[i];//меняем минимальное значение суммы
	}
	average = sum*1.0 / pos;//считаем среднее арифметическое
	printf("average=%lf", average);//выводим значение среднего арифметического
}
int main()//описываем главную функцию
{
	int k;//описываем переменные
	printf("Lab #4 variant 13\n");//выводим номер лабораторной работы и варианта
	printf("insert  number of elements k:");//просим ввести количество элементов массива
	scanf_s("%d", &k);//считываем количество элементов массива
	createmasB(k);//вызываем функцию по созданию массива
	printmasB(k);//вызываем функцию по выводу массива
	task1(k);//вызываем функцию для выполнения 1 задачи
	task2(k);//вызываем функцию по выполнению задачи 2
	free(B);//освобождаем память
	return 0;
}
