#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>//подключение библиотек
#include<math.h>//подключение библиотек
#include<stdlib.h>//подключение библиотек
#include<string.h>//подключение библиотек
int create(const char*name)//функция ввода данных в файл
{
	int i, n, *a;//описание переменных
	FILE*f = fopen(name, "wb");//создание файла
	if (!f)//проверка создания
	{
		printf("file can't be created\n");//сообщение об ошибке
		return 0;//завершение программы
	}
	printf("input number of elements:\n");//просим ввести количество элементов
	scanf_s("%d", &n);//считываем количество элементов
	a = (int*)malloc(n * sizeof(int));//выделение памяти для массива
	printf("input elements:\n");//просим ввести данные
	for (i = 0; i < n; i++)//цикл для ввода данных в массив
	{
		scanf_s("%d", &a[i]);//записываем данные в массив
	}
	fwrite(a, sizeof(int), n, f);//записываем массив в файл
	fclose(f);//закрываем файл
	free(a);//освобождаем память, выделенную для массива
	return n;//возвращаем количество введенных элементов
}
int createb(const char*name,int n)//функция для ввода данных задание b
{
	int i;//описание целых переменных
	char *a = (char*)malloc(10000 * sizeof(char)), space[5] = "\n";//описание символьных переменных
	FILE*f = fopen(name, "wt");//создание файла
	if (!f)//проверка создания файла
	{
		printf("file can't be created\n");//сообщение об ошибке
		return 0;//завершение выполнения программы
	}
	rewind(stdin);//возвращаем курсор в начало 
	for (i = 0; i <n; i++)//цикл для записи данных в файл
	{
		printf("input %d string\n", i + 1);//просим вывести i-тую строку
		gets(a, 10000);//считываем строку
		fputs(a, f);//помещаем строку в файл
		fputs(space, f);//помещаем в файл перенос строки
	}
	fclose(f);//закрытие файла
	printf("\n");//перенос строки
}
void print(const char*name, int n)//функция для вывода данных из файла на экран
{
	int a, i;//описание переменных
	FILE*f = fopen(name, "rb");//открытие файла
	if (!f)//проверка открытия
	{
		printf("file can't be opened\n");//сообщение об ошибке
		return;//завершение программы
	}
	printf("You've put:\n");//оформление вывода
	while (!feof(f))//ограничение цикла концом файла
	{
		for (i = 0; i < n; i++)//цикл для вывода данных из файла на экран
		{
			fread(&a, sizeof(int), 1, f);//чтение данных из файла
			if (!feof(f))//проверка конца файла
			{
				printf("%d ", a);//вывод на экран
			}
		}

	}
	printf("\n");//перенос строки
}
void printb(const char*name, int n)//функция для вывода данных из файла на экран задание b
{
	int i;//описание целых переменных
	char *a = (char*)malloc(10000 * sizeof(char));//описание символьных переменных
	FILE*f = fopen(name, "rt");//открытие файла
	if (!f)//проверка открытия файла
	{
		printf("file can't be opened\n");//сообщение об ошибке
		return 0;//завершение программы
	}
	printf("You've put:\n");//оформление вывода
	while (!feof(f))//ограничение цикла концом файла
	{
		fgets(a,10000, f);//чтение данных из файла
		if (!feof(f))//проверка конца файла
		{
			printf("%s", a);//вывод на экран
		}
	}
}
void task(const char*name, int n)//функция для выполнения задания
{
	int i, a,count=0,ost,*b;//объявление целых переменных
	FILE*f = fopen(name, "rb");//открытие файла
	b = (int*)malloc(n * sizeof(int));//выделение памяти для массива
	if (!f)//проверка открытия файла
	{
		printf("file can't be opened\n");//сообщение об ошибке
		return;//завершение программы
	}
	while (!feof(f))//ограничение цикла концом файла
	{
		for (i = 0; i < n; i++)//цикл для считывания данных из файла
		{
			fread(&b[i], sizeof(int), 1, f);//считывание данных с файла
			if (!feof(f))//проверка конца файла
			{
				ost = floor(sqrt(b[i]));//нахождение целой части от извлечения корня
				if ((b[i] % 2 != 0) && (b[i] - (ost*ost) == 0))//проверка соответствия условию
				{
					count++;//увеличение счетчика
				}
			}
		}
	}
	b = (int*)realloc(b, (n + 1) * sizeof(int));//увеличение выделенной для массива памяти
	for (i = 0; i <n; i++)//цикл для добавления нового элемента в начало массива
	{
		b[n-i] = b[n - i-1];//перемещение элементов массива
	}
	b[0] = count;//присваиваем нулевому элементу массива новое значение
	printf("\n");//перенос строки
	fclose(f);//закрытие файла
	f = fopen(name, "w+b");//открытие файла с другими функциями
	fwrite(b, sizeof(int), n+1, f);//запись массива в файл
	rewind(f);//перенос курсива в начало
	printf("result:\n");//вывод слова "result"
	for (i = 0; i <= n; i++)//цикл для считывания данных из файла и вывода на консоль
	{
		fread(&b[i], sizeof(int), 1, f);//чтение данных из файла
		if (!feof(f))//проверка конца файла
		{
			printf("%d ", b[i]);//вывод данных на экран
		}
	}
	free(b);//освобождение памяти, выделенной для массива
	fclose(f);//закрытие файла
}
void taskb(const char*name, int n)//функия для выполнения задания b
{
	int l, len[10] = { 0 }, i,b;//описание целых переменных
	char a[15],ch[5],space[5]=" ",enter[5]="\n",ch2[5];//описание символьных переменных
	FILE*f = fopen(name, "rt");//открытие файла
	while (!feof(f))//ограничение цикла концом файла
	{
		fscanf(f,"%s", a);//чтение данных из файла
		if (!feof(f))//проверка конца файла
		{
			l = strlen(a);//узнаем длину строки(слова)
			len[l - 1]++;//увеличиваем соответствующий элемент массива
		}
	}
	const char*name2 = "result.txt";//объявляем имя нового файла
	FILE*g = fopen(name2, "wt");//создаем новый файл
	if (!f)//проверка создания
	{
		printf("file can't be created\n");//сообщение об ошибке
		return 0;//завершение программы
	}
	for (i = 0; i < 10; i++)//цикл для записи данных в файл
	{
		b = i + 1;//увеличение переменной, обозначающей количество букв в слове
		_itoa(b, ch, 10);//перевод ее в символьных тип
		strcat(ch, space);//присоединение к ней пробела
		fputs(ch, g);//запись в новый файл
		_itoa(len[i],ch2,10);//перевод переменной, обозначающей количество слов с определенным количеством букв, в символьный тип
		strcat(ch2, enter);//присоединение к ней переноса строки
		fputs(ch2, g);//запись ее в новый файл
	}
}
void menu()//функция для выбора выполнения задания
{
	char* w[5];//объявление символьного массива
	printf("What task do you want to do?\na)task with numbers\nb)task with words\n");//спрашиваем у пользователя про выбор задания
	scanf("%s",w);//считываем выбор
	if (strcmp(w, "a") == 0)//сравниваем с выбором "a"
	{
		int n;//объявляем целую переменную
		const char*name = "numbers.bin";//объявляем имя бинарного файла
		n = create(name);//вызываем функцию для создания файла
		print(name, n);//вызываем функцию для вывода файла
		task(name, n);//вызываем функцию для выполнения задания
	}
	else//иначе
	{
		if (strcmp(w, "b") == 0)//сравниваем с выбором "b"
		{
			int n;//объявляем целую переменную
			const char*name = "word.txt";//объявляем имя текстового файла
			printf("input number of strings:\n");//просим ввести количество строк
			scanf_s("%d", &n);//считываем количество строк
			createb(name, n);//вызываем функцию для создания файла
			printb(name, n);//вызываем функцию для вывода файла
			taskb(name, n);//вызываем функцию для выполнения задания
		}
		else//иначе
		{
			printf("You chose nonexistent task\nTry again\n");//просим повторить выбор
			menu();//заново вызываем функцию для выбора выполнения задания
		}
	}
}

int main()//функция main
{
	printf("Lab#8 variant 13\n");//вывод номера лабораторной работы и варианта
	menu();//вызов функции для выбора выполнения задания
	return 0;//завершение программы
}
