#pragma once
#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>//библиотека для ввода и вывода
#include<stdlib.h>//библиотека для работы со строками
#include<malloc.h>//библиотека для работы функции malloc
#include"Player.h"//заголовочный файл со структурой
#include"N.h"//заголовочный файл с глобальными переменными
void edit(const char*name)//функция для изменения данных в файле
{
	int num,task,i;//объявление целых переменных
	FILE*f = fopen(name, "rb");//открытие файла
	if (!f)//проверка создания
	{
		printf("file can't be opened\n");//сообщение об ошибке
		return;//завершение программы
	}
	fseek(f, 0, SEEK_END);//перемещение каретки в конец файла
	n = (ftell(f)) / sizeof(player);//узнаем количество элементов в файле
	fseek(f, 0, SEEK_SET);//перемещение каретки в начало файла
	if (data != NULL)//проверка для очистки структуры
	{
		free(data);//очищение структуры
	}
	data = (player*)malloc(n * sizeof(player));//выделение памяти для структуры
	for (i = 0; i < n; i++)//цикл для записи данных из файла в структуру
	{
		fread(&data[i], sizeof(player), 1, f);//записываем в структуру данные, которые лежат в файле
	}
	fclose(f);//закрытие файла
	printf("|  |   name   | surname  |dad's name|   club   |  amplua  |   age    |   plays  |  goals   |\n");//выводим названия столбцов
	printf("--------------------------------------------------------------------------------------------\n");//строка для красивого вывода
	for (i = 0; i < n; i++)//цикл для вывода структуры на экран
	{
		printf("|%d.|%10s|", i + 1, &data[i].fio.imya);//выводим имя
		printf("%10s|", &data[i].fio.familia);//выводим фамилию
		printf("%10s|", &data[i].fio.otchestvo);//выводим отчество
		printf("%10s|", &data[i].club);//выводим клуб
		printf("%10s|", &data[i].amplua);//выводим амплуа
		printf("%10s|", &data[i].age);//выводим возраст
		printf("%10s|", &data[i].plays);//выводим количество игр
		printf("%10s|\n", &data[i].goals);//выводим количество голов
		printf("--------------------------------------------------------------------------------------------\n");//строка для красивого вывода
	}
	printf("input number of player that you want to edit\n"); //просим ввести номер игрока, которого надо отредактировать
	scanf("%d", &num);//считываем номер нужного игрока
	printf("Which parameter do you want to edit?\n1)Name\n2)Surname\n3)Father's name\n4)Player's club\n5)Amplua\n6)Player's age\n7)Number of Plyer's plays\n8)Number of player's goals\n");//спрашиваем, что именно нужно отредактировать
	scanf("%d", &task);//записываем выбор в переменную
	printf("input new information\n");//просим ввести новые данные
	switch (task)//функция для изменения различных данных
	{
		case 1://случай для изменения имени
		{
			scanf("%s", data[num-1].fio.imya);//записываем новые данные
			break;//завершаем выполнение данного случая
		}
		case 2://случай для изменения фамилии
		{
			scanf("%s", data[num-1].fio.familia);//записываем новые данные
			break;//завершаем выполнение данного случая
		}
		case 3://случай для изменения отчества
		{
			scanf("%s", data[num-1].fio.otchestvo);//записываем новые данные
			break;//завершаем выполнение данного случая
		}
		case 4://случай для изменения клуба
		{
			scanf("%s", data[num-1].club);//записываем новые данные
			break;//завершаем выполнение данного случая
		}
		case 5://случай для изменения амплуа
		{
			scanf("%s", data[num-1].amplua);//записываем новые данные
			break;//завершаем выполнение данного случая
		}
		case 6://случай для изменения возраста
		{
			scanf("%s", data[num-1].age);//записываем новые данные
			break;//завершаем выполнение данного случая
		}
		case 7://случай для изменения количества игр
		{
			scanf("%s", data[num-1].plays);//записываем новые данные
			break;//завершаем выполнение данного случая
		}
		case 8://случай для изменения количества забитых голов
		{
			scanf("%s", data[num-1].goals);//записываем новые данные
			break;//завершаем выполнение данного случая
		}
	}
	f = fopen(name, "wb");//открываем файл для записи заново
	for (i = 0; i < n; i++)//цикл для записи в файл
	{
		fwrite(&data[i], sizeof(player), 1, f);//запись в файл
	}
	fclose(f);//закрытие файла
	menu(name);//вызов функции меню
		
}
