#pragma once
#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>//библиотека для ввода и вывода
#include<stdlib.h>//библиотека для работы со строками
#include<malloc.h>//библиотека для работы функции malloc
#include"Player.h"//заголовочный файл со структурой
#include"N.h"//заголовочный файл с глобальными переменными
void find(const char*name)//функция для поиска в файле
{
	int task,i;//объявление целых переменных
	FILE*f = fopen(name, "rb");//открытие файла
	if (!f)//проверка создания
	{
		printf("file can't be opened\n");//сообщение об ошибке
		return;//завершение программы
	}
	fseek(f, 0, SEEK_END);//перемещение каретки в конец файла
	n = (ftell(f)) / sizeof(player);//узнаем количество элементов в файле
	fseek(f, 0, SEEK_SET);//перемещение каретки в начало файла
	if (data != NULL)//проверка для очистки структуры
	{
		free(data);//очищение структуры
	}
	data = (player*)malloc(n * sizeof(player));//выделение памяти для структуры
	for (i = 0; i < n; i++)//цикл для записи данных из файла в структуру
	{
		fread(&data[i], sizeof(player), 1, f);//записываем в структуру данные, которые лежат в файле
	}
	fclose(f);//закрытие файла
	printf("By which parameter do you want to find the player?\n1)Name\n2)Surname\n3)Father's name\n4)Player's club\n5)Amplua\n6)Player's age\n7)Number of Plyer's plays\n8)Number of player's goals\n");//спрашиваем по какому параметру надо найти игрока
	scanf("%d", &task);//записываем параметр в переменную
	switch (task)//функция для поиска по различным параметрам
	{
	case 1://поиск по имени
	{
		int i, count = 0;//объявление целых переменных
		char imya[10];//переменная, в которой лежит нужный параметр
		printf("input name that you need\n");//просим ввести имя для поиска
		scanf("%s", imya);//считываем параметр для поиска
		printf("|  |   name   | surname  |dad's name|   club   |  amplua  |   age    |   plays  |  goals   |\n");//выводим названия столбцов
		printf("--------------------------------------------------------------------------------------------\n");//строка для красивого вывода
		for (i = 0; i < n; i++)//цикл для сравнения
		{
			if (strcmp(imya, data[i].fio.imya) == 0)//сравниваем введенный параметр с параметром в структуре
			{
				printf("|%d.|%10s|", i + 1, &data[i].fio.imya);
				printf("|%d.|%10s|", i + 1, &data[i].fio.imya);//выводим имя
				printf("%10s|", &data[i].fio.familia);//выводим фамилию
				printf("%10s|", &data[i].fio.otchestvo);//выводим отчество
				printf("%10s|", &data[i].club);//выводим клуб
				printf("%10s|", &data[i].amplua);//выводим амплуа
				printf("%10s|", &data[i].age);//выводим возраст
				printf("%10s|", &data[i].plays);//выводим количество игр
				printf("%10s|\n", &data[i].goals);//выводим количество голов
			}
		}
		printf("--------------------------------------------------------------------------------------------\n");//строка для красивого вывода
		break;//завершение выполнения данного случая
	}
	case 2://поиск по фамилии
	{
		int i, count = 0;//объявление целых переменных
		char familia[10];//переменная, в которой лежит нужный параметр
		printf("input surname that you need\n");//просим ввести фамилию для поиска
		scanf("%s", familia);//считываем параметр для поиска
		printf("|  |   name   | surname  |dad's name|   club   |  amplua  |   age    |   plays  |  goals   |\n");//выводим названия столбцов
		printf("--------------------------------------------------------------------------------------------\n");//строка для красивого вывода
		for (i = 0; i < n; i++)//цикл для сравнения
		{
			if (strcmp(familia, data[i].fio.familia) == 0)//сравниваем введенный параметр с параметром в структуре
			{
				printf("|%d.|%10s|", i + 1, &data[i].fio.imya);//выводим имя
				printf("%10s|", &data[i].fio.familia);//выводим фамилию
				printf("%10s|", &data[i].fio.otchestvo);//выводим отчество
				printf("%10s|", &data[i].club);//выводим клуб
				printf("%10s|", &data[i].amplua);//выводим амплуа
				printf("%10s|", &data[i].age);//выводим возраст
				printf("%10s|", &data[i].plays);//выводим количество игр
				printf("%10s|\n", &data[i].goals);//выводим количество голов
			}
		}
		printf("--------------------------------------------------------------------------------------------\n");//строка для красивого вывода
		break;//завершение выполнения данного случая
	}
	case 3://поиск по отчеству
	{
		int i, count = 0;//объявление целых переменных
		char otchestvo[10];//переменная, в которой лежит нужный параметр
		printf("input father's name that you need\n");//просим ввести отчество для поиска
		scanf("%s", otchestvo);//считываем параметр для поиска
		printf("|  |   name   | surname  |dad's name|   club   |  amplua  |   age    |   plays  |  goals   |\n");//выводим названия столбцов
		printf("--------------------------------------------------------------------------------------------\n");//строка для красивого вывода
		for (i = 0; i < n; i++)//цикл для сравнения
		{
			if (strcmp(otchestvo, data[i].fio.otchestvo) == 0)//сравниваем введенный параметр с параметром в структуре
			{
				printf("|%d.|%10s|", i + 1, &data[i].fio.imya);//выводим имя
				printf("%10s|", &data[i].fio.familia);//выводим фамилию
				printf("%10s|", &data[i].fio.otchestvo);//выводим отчество
				printf("%10s|", &data[i].club);//выводим клуб
				printf("%10s|", &data[i].amplua);//выводим амплуа
				printf("%10s|", &data[i].age);//выводим возраст
				printf("%10s|", &data[i].plays);//выводим количество игр
				printf("%10s|\n", &data[i].goals);//выводим количество голов
			}
		}
		printf("--------------------------------------------------------------------------------------------\n");//строка для красивого вывода
		break;//завершение выполнения данного случая
	}
	case 4://поиск по клубу
	{
		int i, count = 0;//объявление целых переменных
		char club[10];//переменная, в которой лежит нужный параметр
		printf("input club that you need\n");//просим ввести клуб для поиска
		scanf("%s", club);//считываем параметр для поиска
		printf("|  |   name   | surname  |dad's name|   club   |  amplua  |   age    |   plays  |  goals   |\n");//выводим названия столбцов
		printf("--------------------------------------------------------------------------------------------\n");//строка для красивого вывода
		for (i = 0; i < n; i++)//цикл для сравнения
		{
			if (strcmp(club, data[i].club) == 0)//сравниваем введенный параметр с параметром в структуре
			{
				printf("|%d.|%10s|", i + 1, &data[i].fio.imya);//выводим имя
				printf("%10s|", &data[i].fio.familia);//выводим фамилию
				printf("%10s|", &data[i].fio.otchestvo);//выводим отчество
				printf("%10s|", &data[i].club);//выводим клуб
				printf("%10s|", &data[i].amplua);//выводим амплуа
				printf("%10s|", &data[i].age);//выводим возраст
				printf("%10s|", &data[i].plays);//выводим количество игр
				printf("%10s|\n", &data[i].goals);//выводим количество голов
			}
		}
		printf("--------------------------------------------------------------------------------------------\n");//строка для красивого вывода
		break;//завершение выполнения данного случая
	}
	case 5://поиск по амплуа
	{
		int i, count = 0;//объявление целых переменных
		char amplua[10];//переменная, в которой лежит нужный параметр
		printf("input amplua that you need\n");//просим ввести амплуа для поиска
		scanf("%s", amplua);//считываем параметр для поиска
		printf("|  |   name   | surname  |dad's name|   club   |  amplua  |   age    |   plays  |  goals   |\n");//выводим названия столбцов
		printf("--------------------------------------------------------------------------------------------\n");//строка для красивого вывода
		for (i = 0; i < n; i++)//цикл для сравнения
		{
			if (strcmp(amplua, data[i].amplua) == 0)//сравниваем введенный параметр с параметром в структуре
			{
				printf("|%d.|%10s|", i + 1, &data[i].fio.imya);//выводим имя
				printf("%10s|", &data[i].fio.familia);//выводим фамилию
				printf("%10s|", &data[i].fio.otchestvo);//выводим отчество
				printf("%10s|", &data[i].club);//выводим клуб
				printf("%10s|", &data[i].amplua);//выводим амплуа
				printf("%10s|", &data[i].age);//выводим возраст
				printf("%10s|", &data[i].plays);//выводим количество игр
				printf("%10s|\n", &data[i].goals);//выводим количество голов
			}
		}
		printf("--------------------------------------------------------------------------------------------\n");//строка для красивого вывода
		break;//завершение выполнения данного случая
	}
	case 6://поиск по возрасту
	{
		int i, count = 0;//объявление целых переменных
		char age[3];//переменная, в которой лежит нужный параметр
		printf("input age that you need\n");//просим ввести возраст для поиска
		scanf("%s", age);//считываем параметр для поиска
		printf("|  |   name   | surname  |dad's name|   club   |  amplua  |   age    |   plays  |  goals   |\n");//выводим названия столбцов
		printf("--------------------------------------------------------------------------------------------\n");//строка для красивого вывода
		for (i = 0; i < n; i++)//цикл для сравнения
		{
			if (strcmp(age, data[i].age) == 0)//сравниваем введенный параметр с параметром в структуре
			{
				printf("|%d.|%10s|", i + 1, &data[i].fio.imya);//выводим имя
				printf("%10s|", &data[i].fio.familia);//выводим фамилию
				printf("%10s|", &data[i].fio.otchestvo);//выводим отчество
				printf("%10s|", &data[i].club);//выводим клуб
				printf("%10s|", &data[i].amplua);//выводим амплуа
				printf("%10s|", &data[i].age);//выводим возраст
				printf("%10s|", &data[i].plays);//выводим количество игр
				printf("%10s|\n", &data[i].goals);//выводим количество голов
			}
		}
		printf("--------------------------------------------------------------------------------------------\n");//строка для красивого вывода
		break;//завершение выполнения данного случая
	}
	case 7://поиск по количеству игр
	{
		int i, count = 0;//объявление целых переменных
		char plays[5];//переменная, в которой лежит нужный параметр
		printf("input number of plays that you need\n");//просим ввести количество игр для поиска
		scanf("%s", plays);//считываем параметр для поиска
		printf("|  |   name   | surname  |dad's name|   club   |  amplua  |   age    |   plays  |  goals   |\n");//выводим названия столбцов
		printf("--------------------------------------------------------------------------------------------\n");//строка для красивого вывода
		for (i = 0; i < n; i++)//цикл для сравнения
		{
			if (strcmp(plays, data[i].plays) == 0)//сравниваем введенный параметр с параметром в структуре
			{
				printf("|%d.|%10s|", i + 1, &data[i].fio.imya);//выводим имя
				printf("%10s|", &data[i].fio.familia);//выводим фамилию
				printf("%10s|", &data[i].fio.otchestvo);//выводим отчество
				printf("%10s|", &data[i].club);//выводим клуб
				printf("%10s|", &data[i].amplua);//выводим амплуа
				printf("%10s|", &data[i].age);//выводим возраст
				printf("%10s|", &data[i].plays);//выводим количество игр
				printf("%10s|\n", &data[i].goals);//выводим количество голов
			}
		}
		printf("--------------------------------------------------------------------------------------------\n");//строка для красивого вывода
		break;//завершение выполнения данного случая
	}
	case 8://поиск по количеству голов
	{
		int i, count = 0;//объявление целых переменных
		char goals[6];//переменная, в которой лежит нужный параметр
		printf("input number of goals that you need\n");//просим ввести количество забитых голов для поиска
		scanf("%s", goals);//считываем параметр для поиска
		printf("|  |   name   | surname  |dad's name|   club   |  amplua  |   age    |   plays  |  goals   |\n");//выводим названия столбцов
		printf("--------------------------------------------------------------------------------------------\n");//строка для красивого вывода
		for (i = 0; i < n; i++)//цикл для сравнения
		{
			if (strcmp(goals, data[i].goals) == 0)//сравниваем введенный параметр с параметром в структуре
			{
				printf("|%d.|%10s|", i + 1, &data[i].fio.imya);//выводим имя
				printf("%10s|", &data[i].fio.familia);//выводим фамилию
				printf("%10s|", &data[i].fio.otchestvo);//выводим отчество
				printf("%10s|", &data[i].club);//выводим клуб
				printf("%10s|", &data[i].amplua);//выводим амплуа
				printf("%10s|", &data[i].age);//выводим возраст
				printf("%10s|", &data[i].plays);//выводим количество игр
				printf("%10s|\n", &data[i].goals);//выводим количество голов
			}
		}
		printf("--------------------------------------------------------------------------------------------\n");//строка для красивого вывода
		break;//завершение выполнения данного случая
	}
	}
	menu(name);//вызов функции меню
}
