#pragma once
#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>//библиотека для ввода и вывода
#include<stdlib.h>//библиотека для работы со строками
#include<malloc.h>//библиотека для работы функции malloc
#include"N.h"//заголовочный файл с глобальными переменными
void output(const char*name)//функция для вывода данных на экран
{
	int i;//объявление счетчика
	FILE*f = fopen(name, "rb");//открытие файла
	if (!f)//проверка создания
	{
		printf("file can't be opened\n");//сообщение об ошибке
		return;//завершение программы
	}
	fseek(f, 0, SEEK_END);//перемещение каретки в конец файла
	n = (ftell(f)) / sizeof(player);//узнаем количество элементов в файле
	fseek(f, 0, SEEK_SET);//перемещение каретки в начало файла
	if (data != NULL)//проверка для очистки структуры
	{
		free(data);//очищение структуры
	}
	data = (player*)malloc(n * sizeof(player));//выделение памяти для структуры
	for (i = 0; i < n; i++)//цикл для записи данных из файла в структуру
	{
		fread(&data[i], sizeof(player), 1, f);//записываем в структуру данные, которые лежат в файле
	}
	printf("|  |   name   | surname  |dad's name|   club   |  amplua  |   age    |   plays  |  goals   |\n");//выводим названия столбцов
	printf("--------------------------------------------------------------------------------------------\n");//строка для красивого вывода
	for (i = 0; i < n; i++)//цикл для вывода структуры на экран
	{
		printf("|%d.|%10s|",i+1, &data[i].fio.imya);//выводим имя
		printf("%10s|", &data[i].fio.familia);//выводим фамилию
		printf("%10s|", &data[i].fio.otchestvo);//выводим отчество
		printf("%10s|", &data[i].club);//выводим клуб
		printf("%10s|",&data[i].amplua);//выводим амплуа
		printf("%10s|",&data[i].age);//выводим возраст
		printf("%10s|", &data[i].plays);//выводим количество игр
		printf("%10s|\n", &data[i].goals);//выводим количество голов
		printf("--------------------------------------------------------------------------------------------\n");//строка для красивого вывода
	}
	fclose(f);//закрытие файла
	menu(name);//вызов меню
	return;//завершение выполнения функции
}
