#pragma once
typedef struct tagfio////структура, которая содержит ФИО игрока
{
	char imya[10];//объявление переменной, которая содержит имя игрока
	char familia[10];//объявление переменной, которая содержит фамилию игрока
	char otchestvo[10];//объявление переменной, которая содержит отчество игрока
}fio;

typedef struct tagplayer//структура, которая содержит данные игрока
{
	struct tagfio fio;//объявление структуры, которая содержит ФИО игрока
	char club[30];//объявление переменной, которая содержит клуб игрока
	char amplua[15];//объявление переменной, которая содержит амплуа игрока
	char age[3];//объявление переменной, которая содержит возраст игрока
	char plays[5];//объявление переменной, которая содержит количество игр игрока
	char goals[6];//объявление переменной, которая содержит количество голов, забитых игроком
}player;
