#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>//библиотека для ввода и вывода
#include<stdlib.h>//библиотека для работы со строками
#include"Player.h"//заголовочный файл со структурой
#include"N.h"//заголовочный файл с глобальными переменными
void menu(const char*name)//функция для выбора задания
{
	int task;//переменная, в которую записывается выбор задания
	printf("Which task do you want to do?\n1)add to the base\n2)delete from the base\n3)find in the base\n4)edit in the base\n5)sort the base\n6)output base on the screen\n7)exit\n\n");//вывод доступных для пользователя заданий
	scanf("%d", &task);//считывание номера задания
		switch (task)//функция для выполнения различных заданий
		{
		case 1://случай выбора 1 задания
		{
			add(name);//вызов функции добавления в файл
			break;//завершение выполнения данного кейса
		}
		case 2://случай выбора 2 задания
		{
			delets(name);//вызов функции удаления из файла
			break;//завершение выполнения данного кейса
		}
		case 3://случай выбора 3 задания
		{
			find(name);//вызов функции поиска в файле
			break;//завершение выполнения данного кейса
		}
		case 4://случай выбора 4 задания
		{
			edit(name);//вызов функции редактирования в файле
			break;//завершение выполнения данного кейса
		}
		case 5://случай выбора 5 задания
		{
			sort(name);//вызов функции сортировки в файле
			break;//завершение выполнения данного кейса
		}
		case 6://случай выбора 6 задания
		{
			output(name);//вызов функции вывода из файла
			break;//завершение выполнения данного кейса
		}
		case 7://случай выбора 7 задания
		{
			return;//завершение выполнения программы
		}
		default://случай, когда ни одно из заданий не выбрано
		{
			printf("This task does not exist\nChoose again:");//сообщение об ошибке
			menu(name);//вызов меню заново
		}
			
		}
}
void file(const char*name)//функция выбора данных
{
	int way;//объявление целой переменной
	printf("Do you want to:\n1)create a new file\n2)use an old one?\n");//оформление пользовательского интерфейса
	scanf("%d", &way);//запись выбора данных с консоли
	switch (way)//функция для выполнения выбора данных
	{
	case 1://функция для выполнения заданий с новыми данными
	{
		fill(name);//вызов функции для заполнения файла новыми данными
		menu(name);//вызов меню
		break;//завершение первого кейса
	}
	case 2://функция для выполнения заданий со старыми данными
	{
		menu(name);//вызов меню
		break;//завершение второго кейса
	}
	default://действия при выборе других варриантов
		file(name);//вызов выбора данных заново
	}
	return;//равершаем выполнение функции
}
int main()//функция main
{
	const char*name = "players.bin";//объявляем название файла, как константу
	file(name);//вызываем функцию выбора данных
	return 0;//завершаем программу
}
